In [1]:
import pandas as pd

In [2]:
path = "../../data/cleaned/merged_sales.csv"
car_sales = pd.read_csv(path)

In [3]:
car_sales2 = car_sales.reset_index(drop=True).set_index("Category")
car_sales3 = car_sales2.T.reset_index()
car_sales3.rename(columns={"index": "year"}, inplace=True)
car_sales3.rename(columns={"EV Sales": "ev_sales", "PHEV Sales": "phev_sales", "Production, total": "tot_prod", "Domestic sales, totalb": "tot_sales"}, inplace=True)

In [4]:
car_sales4 = car_sales3.drop(['Passenger cars', 'Commercial vehiclesa', 'Passenger cars', 'Commercial vehiclesa'], axis=1)
car_sales4["year"] = car_sales4["year"].astype(int)
car_sales4.head()

C:\Users\uv9374\Anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

Category  year  ev_sales  phev_sales  tot_prod  tot_sales
0         2011     10092        7671   8662000   10109000
1         2012     14587       38584  10336000   11582000
2         2013     48094       49008  11067000   12479000
3         2014     63525       55357  11661000   13389000
4         2015     71064       42959  12106000   14128000

In [6]:
path2 = "../../data/cleaned/merged_energy_emission.csv"
emission_energy = pd.read_csv(path2)
# emission_energy.columns

# unit of renewable energy - Trillion BTU, emission unit - Million Metric tons

In [9]:
emission_energy2 = emission_energy[["year","total_emission", "transportation_emission", "motor_emission", "total renewable energy consumption"]]

emission_energy3 = emission_energy2.rename(columns={"total renewable energy consumption": "tot_ren_energy"})
# emission_energy3 = emission_energy3.astype(float64)
emission_energy3.head()

# df = df.astype(int)

   year total_emission transportation_emission motor_emission  tot_ren_energy
0  1990       5,039.90                1,587.60          966.8        6040.024
1  1991       4,994.60                1,567.90          962.4        6067.785
2  1992       5,094.90                1,591.60          979.1        5820.556
3  1993       5,185.80                1,604.20          993.1        6081.635
4  1994       5,263.60                1,644.10       1,004.10        5987.142

In [10]:
merge_df = pd.merge(left=car_sales4, right=emission_energy3, left_on='year', right_on='year')
merge_df

,year,ev_sales,phev_sales,tot_prod,tot_sales,total_emission,transportation_emission,motor_emission,tot_ren_energy
0,2011,10092,7671,8662000,10109000,"5,445.70","1,809.00","1,057.00",9204.160
1,2012,14587,38584,10336000,11582000,"5,229.00","1,773.40","1,051.10",8847.119
2,2013,48094,49008,11067000,12479000,"5,356.00","1,796.40","1,066.00",9450.625
3,2014,63525,55357,11661000,13389000,"5,413.20","1,814.90","1,077.20",9740.360
4,2015,71064,42959,12106000,14128000,"5,262.90","1,838.80","1,083.10",9720.544
5,2016,86731,772885,12180000,13969000,"5,170.40","1,871.00","1,101.60",10362.530
6,2017,104492,91089,11190000,13644000,"5,130.70","1,887.50","1,098.90",11076.515
7,2018,238823,122492,11298000,13717000,"5,280.90","1,917.80","1,099.00",11300.980